{
  "scenes": {
    "start": {
      "text": "You wake up, but nothing around you feels like waking.\n\n3:19AM. The clock blinks even though you don’t remember owning one. The walls hum with quiet static.\n\nThe television is on.\n\nIt sits at the end of the room, flickering in low pulses of light, casting shadows that don't match the furniture. You don’t own a TV. You never have.\n\nThere’s something glinting beside a half-crushed cereal box on the floor. It looks like a ring.\n\nSomewhere, a phone rings once. Then silence.",
      "reminder": "The static bleeds into the air. The carpet smells like sugar and ozone.",
      "flavor": "You feel like you’ve walked into a memory that never aired.",
      "options": {
        "look": "sceneLook",
        "turn on tv": "sceneTV",
        "answer phone": "scenePhone"
      }
    },

    "sceneLook": {
      "text": "Dust moves through the light like it's underwater.\n\nThe cereal boxes are all from shows you barely remember. One is ripped open—shredded from the inside.\n\nThere’s a decoder ring on the carpet. You remember it from a cartoon you used to draw… but it looks older. Dirtier.\n\nNext to it, a shoebox labeled \"SHOW IDEAS\" hums faintly when you lean close.",
      "reminder": "The decoder ring pulses when you breathe too loud.",
      "flavor": "Everything here was left behind. Maybe even you.",
      "options": {}
    },

    "sceneTV": {
      "text": "The screen flickers.\n\nA familiar mascot—Captain Chomp—chews through a mailbox. His jaw clicks unnaturally. The animation stutters.\n\nHe stops mid-bite. Looks directly at the screen.\nSmiles.",
      "image": "captain_chomp_glitch.jpg",
      "sound": "glitch_burst.mp3",
      "jumpscare": true,
      "flavor": "You used to draw him. He never used to blink.",
      "options": {}
    },

    "scenePhone": {
      "text": "A distorted voice crackles through the line:\n\n\"You’re seeing it again, aren’t you? Good. We’re almost tuned.\"\n\nThe voice slows, distorts—then continues in a whisper:\n\n\"I’m still in the Vault. Do you remember Captain Chomp?\"",
      "reminder": "The line cuts off. But your phone isn’t a landline.",
      "flavor": "You used to talk like that in play therapy.",
      "options": {}
    },

    "sceneDecoderUnlock": {
      "text": "You grip the decoder ring. It vibrates in your palm like a heartbeat.\n\nYou hold it to the cereal box. Something inside shifts.\n\nThe box unfolds—too precisely—revealing a black VHS tape. No label. No dust.",
      "image": "tape_unlabeled.png",
      "sound": "vhs_load.mp3",
      "flavor": "The static on the TV grows warmer. Like breath.",
      "options": {
        "insert tape": "sceneTape",
        "play tape": "sceneTape"
      }
    },

    "sceneTape": {
      "text": "You insert the tape.\n\nThe screen cuts to black.\nThen:\n\n*“We were never off air.”*\n\nA bright cartoon mascot waves. His face begins to glitch. It doesn’t stop.\n\nHe says, cheerfully: \"Let’s try that again!\"",
      "image": "static_reset.jpg",
      "sound": "glitch_burst.mp3",
      "jumpscare": true,
      "flavor": "You’ve seen this episode before. But not from this side of the screen.",
      "options": {
        "stand up": "sceneFakeEnd"
      }
    },

    "sceneFakeEnd": {
      "text": "You take a deep breath.\n\nThe screen is black. The apartment is quiet.\n\nYou’re safe. You’re awake. You’re home.\n\nBut your feet feel heavy.",
      "image": "tv_static_loop.jpg",
      "sound": "tape_rewind.mp3",
      "flavor": "You can almost hear birds. Morning air. You haven’t felt that in years.",
      "options": {
        "stand up": "sceneTwist"
      }
    },

    "sceneTwist": {
      "text": "You stand.\n\nBut your reflection doesn’t.\n\nThe TV turns on again. It shows your room. Your couch. Your ring. Your face.\n\nOnly… your face is wearing a mask.",
      "image": "mask_closeup.jpg",
      "sound": "tv_static_screech.mp3",
      "jumpscare": true,
      "flavor": "Something is watching from behind your eyes.",
      "options": {}
    }
  }
}
